In [2]:
import pandas as pd
import settings
import os

In [10]:
data = pd.DataFrame(columns=['Company', 'Location', 'Job_Title', 'Subspecialty','Role'])

In [11]:
data.loc[0] = ['Google','San Francisco', 'L4', 'ML','Data Scientist']
data

  Company       Location Job_Title Subspecialty            Role
0  Google  San Francisco        L4           ML  Data Scientist

In [8]:
data = {'Company':['Google', 'Facebook'], 'Location':['San Francisco', 'Seattle'],'Job_Title':['L4','L5'],'Subspecialty':['ML', 'Product'],'Role':['Consultant','Data Scientist']}
data = pd.DataFrame(data=data)
data

    Company       Location Job_Title Subspecialty            Role
0    Google  San Francisco        L4           ML      Consultant
1  Facebook        Seattle        L5      Product  Data Scientist

In [2]:
df = pd.read_csv(os.path.join(settings.PROCESSED_DIR, 'data.csv'), index_col=0).reset_index(drop = True)
df

,Company,Location,Date,Job_Title,Subspecialty,Years_Experience,Total_Comp,Role
0,McKinsey,"San Francisco, CA",10/17/20,Senior Associate,Analytic,7.0,"$198,000",Consultant
1,Facebook,"Menlo Park, CA",10/16/20,L4,Product,5.0,"$177,000",Consultant
2,Accenture,"San Francisco, CA",10/15/20,Consultant,Analytic,3.0,"$120,000",Consultant
3,Salesforce,"Atlanta, GA",10/15/20,8,Operations,7.0,"$178,000",Consultant
4,Oracle,"San Francisco, CA",10/14/20,IC-4,Consumer,10.0,"$82,000",Consultant
...,...,...,...,...,...,...,...,...
30289,Facebook,"Menlo Park, C",| 3/3/20,M1,Developers,NaN,"$660,000",Technical Program Manager
30290,PayPal,"San Jose, C",| 3/3/20,T27,Program,NaN,"$335,000",Technical Program Manager
30291,Amazon,"Seattle, WA",5/14/19,L5,Security,NaN,"$180,000",Technical Program Manager
30292,Amazon,"Sunnyvale, CA",9/13/18,L6,Full Stack,NaN,"$254,000",Technical Program Manager
30293,Google,"Mountain View, CA",8/22/18,L5,Healthcare,NaN,"$269,000",Technical Program Manager

In [22]:
df.groupby(['Company'])['Total_Comp'].count().sort_values().index.value_counts().sum()

756

In [27]:
len(df['Company'].unique())

757

In [30]:
labels = df['Company'].unique()